#+TITLE: Dotfiles
#+AUTHOR: Martín Alsinet
#+DATE: 2017
#+OPTIONS: toc:nil ':t num:nil
#+PROPERTY: header-args:sh :results drawer
#+LANGUAGE: en

* bashrc

Básicamente mi *.bashrc* configura los alias de los comandos que más utilizo en la consola y agrega la carpeta =~/bin= al =$PATH=.

#+BEGIN_SRC sh :tangle build/bashrc
# ls
alias l='ls -lt'
alias ll='ls -alhG'

# docker
alias dps='docker ps'
alias dpsa='docker ps -a'
alias dim='docker images'
docker-du(){
    docker images | grep MB | awk '{print $7}' | awk '{s+=$1} END {print s" MB"}'
}
docker-rmi-none() {
    docker images | grep none | awk '{print $3}' | xargs docker rmi
}

# git
alias gl='git log --pretty=oneline'
alias gst='git status'
alias git-history='git log --format="%ai %s" --reverse | sed "s/....-0[35]00 /  /"'
alias gith='git history'

# path
export PATH=$PATH:~/bin
#+END_SRC

* emacs

Mis configuración de *emacs* se encuentra en los archivos:

- [[file:emacs-init.el][emacs-init.el]]
- [[file:emacs-config.org][emacs-config.org]]

* Paquetes
*** Mac OS X (homebrew)
**** Paquetes instalados

Guardamos en el archivo =./build/brew-packages.txt= los paquetes actualmente instalados.

#+BEGIN_SRC sh
brew list > build/brew-packages.txt
#+END_SRC

Cargamos en la variable =packages= el contenido del archivo con el listado de paquetes

#+NAME: packages
#+BEGIN_SRC sh
cat build/brew-packages.txt | tr "\n" " " 
#+END_SRC

#+RESULTS: packages
:results:
ack adns aspell autoconf automake bash-completion bdw-gc ctags dos2unix emacs ffmpeg freetype gdbm gettext ghostscript git-flow-avh glib gmp gnu-getopt gnu-typist gnupg gnutls icu4c jpeg lame libassuan libevent libffi libgcrypt libgpg-error libidn2 libksba libpng libssh2 libtasn1 libtiff libtool libunistring libusb libvo-aacenc links little-cms2 midnight-commander nettle nmap node npth ntfs-3g openssl openssl@1.1 p11-kit pcre pinentry pkg-config prettier python readline s-lang sqlite ssh-copy-id tnftp unbound unrar w3m wget x264 xvid xz 
:end:

**** Instalar

#+BEGIN_SRC sh :var pkg=packages
echo brew install $pkg
#+END_SRC

#+RESULTS:
:results:
brew install ack adns aspell autoconf automake bash-completion bdw-gc ctags dos2unix emacs ffmpeg freetype gdbm gettext ghostscript git-flow-avh glib gmp gnu-getopt gnu-typist gnupg gnutls icu4c jpeg lame libassuan libevent libffi libgcrypt libgpg-error libidn2 libksba libpng libssh2 libtasn1 libtiff libtool libunistring libusb libvo-aacenc links little-cms2 midnight-commander nettle nmap node npth ntfs-3g openssl openssl@1.1 p11-kit pcre pinentry pkg-config prettier python readline s-lang sqlite ssh-copy-id tnftp unbound unrar w3m wget x264 xvid xz
:end:

**** Actualizar

#+BEGIN_SRC sh
brew upgrade
#+END_SRC

* setup

Ejecutar =org-babel-tangle= y luego ejectuar el siguiente bloque de código con =C-c C-c=

#+BEGIN_SRC sh
cd ~
ln -sF Documents/repos/dotfiles
ln -sf dotfiles/build/bashrc .bashrc
ln -sf dotfiles/emacs-init.el .emacs
cd .emacs.d
ln -sf ../dotfiles/emacs-config.org config.org
#+END_SRC

#+RESULTS:

